{
  "selectedTemplate": 1,
  "headings": {
    "education": "Education",
    "projects": "",
    "awards": "",
    "work": "Work Experience ",
    "skills": "Skills"
  },
  "basics": {
    "email": "johndoe@example.com",
    "name": "John Doe",
    "phone": "+1-123-456-7890",
    "location": {
      "address": "123 Main St, Apt 4B, New York, NY 10001"
    }
  },
  "education": [
    {
      "location": "Standford , CA",
      "studyType": "MS",
      "endDate": "Jun 2019",
      "gpa": "8",
      "institution": "Standford University ",
      "area": "Computer Science ",
      "startDate": "Aug 2015"
    }
  ],
  "work": [
    {
      "location": "Mountain View, CA",
      "website": "",
      "startDate": "May 2021",
      "endDate": "Present",
      "highlights": [
        "Design, develop, and train machine learning models for various applications like NLP, computer vision, and recommendation systems. Select appropriate ML algorithms based on problem requirements and optimize them for accuracy and efficiency. Collect, clean, and preprocess large datasets for training ML models. Perform exploratory data analysis (EDA) to identify patterns, trends, and insights. Implement data augmentation and transformation techniques to improve model performance. Deploy ML models into production environments using cloud platforms like AWS, GCP, or Azure. Monitor and maintain deployed models, ensuring real-time performance and accuracy. Implement CI/CD pipelines for continuous model updates and integration with existing systems. Evaluate model performance using metrics such as precision, recall, F1-score, and RMSE. Continuously improve models by retraining with new data and optimizing hyperparameters. Identify and mitigate model drift, bias, and fairness issues. Stay updated with the latest advancements in ML and AI, exploring new algorithms and techniques. Experiment with state-of-the-art deep learning architectures to enhance model performance. Publish research findings, contribute to open-source projects, or present at conferences. Work closely with data engineers, software developers, and domain experts to integrate ML solutions. Document ML processes, experiments, and results for reproducibility and knowledge sharing. Present findings, insights, and recommendations to stakeholders and decision-makers."
      ],
      "company": "Apple",
      "position": "Machine Learning Engineer"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "Python",
        "Javascript",
        null,
        ""
      ],
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "GenAI"
      ],
      "name": "Technical Skills"
    }
  ],
  "projects": [
    {
      "name": "",
      "description": "",
      "url": "",
      "keywords": [
        ""
      ]
    }
  ],
  "awards": [
    {
      "title": "",
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "education",
    "work",
    "skills",
    "projects",
    "awards"
  ]
}